### PANDAS--> Pandas is a Python library used for data manipulation and analysis. It is especially useful for working with structured data like tables (like excel)

### it uses the power and speed of numpy to make data analysis and preprocessing easy for data scientists.

### "PANDAS HAS TWO TYPES OF DATA STRUCTURES :"
###  a> Series--> A one-dimensional labeled array with indexes (like a column in table).
                  # Can store integers, floats, strings
###  b> DataFrame--> It's a tabular spreadsheet like structure representing rows each                         of which contains one or more columns.(2-dimensional)

In [2]:
import pandas as pd
s = pd.Series([10, 20, 30, 40]) 
print(s)

# why dtype is getting printed ?
  #dtype is printed to show the data type of the Series or column,
   #so you know what kind of values it holds (like integer, float, string).

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
dict1 = {
    "name": ['bheem', 'nakul', 'krishna', 'Arjun'],
    "marks": [92, 76, 98, 54],
    "city": ['hastinapur', 'madrapur', 'mathura', 'panchal']
  }   

df = pd.DataFrame(dict1)  #df is a Pandas DataFrame, which is like a table or spreadsheet in Python
df

      name  marks        city
0    bheem     92  hastinapur
1    nakul     76    madrapur
2  krishna     98     mathura
3    Arjun     54     panchal

In [8]:
df.to_csv('friends.csv')

In [9]:
df.to_csv('friends_index_false.csv', index=False)

 #By default, Pandas writes the row index (0,1,2,…) to the CSV.
 #index=False tells Pandas not to write the index in the CSV.

In [12]:
df.head(2) # shows starting two rows.

    name  marks        city
0  bheem     92  hastinapur
1  nakul     76    madrapur

In [13]:
df.tail(2) # shows ending two rows.

      name  marks     city
2  krishna     98  mathura
3    Arjun     54  panchal

In [14]:
df.describe() #gives a quick statistical summary of the numeric columns in a DataFrame.

           marks
count   4.000000
mean   80.000000
std    19.663842
min    54.000000
25%    70.500000
50%    84.000000
75%    93.500000
max    98.000000

In [21]:
friends.index = ['1st', '2nd', '3rd', '4th'] # changing of index numbers
friends

     Unnamed: 0     name  marks        city
1st           0    bheem     34  hastinapur
2nd           1    nakul     76    madrapur
3rd           2  krishna     98     mathura
4th           3    Arjun     54     panchal

In [25]:
import numpy as np
ser = pd.Series(np.random.rand(34))  
type(ser)

#np.random.rand(34) → generates 34 random numbers between 0 and 1 as a NumPy array.
#pd.Series(...) → converts that array into a Pandas Series, which is a 1-dimensional labeled array with an automatic index from 0 to 33.
#type(ser) → <class 'pandas.core.series.Series'>, meaning it’s now a Pandas object, not just a NumPy array.

pandas.core.series.Series

In [35]:
import numpy as np
#converts it into a DataFrame with 336 rows and 5 columns.
newdf = pd.DataFrame(np.random.rand(3,4), index=np.arange(3))
newdf
type(newdf)  

newdf.describe()

newdf.dtypes

newdf.shape

newdf.head(5)   # first 5 rows
newdf.tail(3)   # last 3 rows

newdf.T  # transpose

newdf.sort_index(axis=0, ascending=False)
newdf2=newdf
 #newdf2[0][0]=5356
#newdf

newdf.loc[0,0]=56
newdf.head(2)

newdf.columns = list("ABCD")
newdf

          C         D
1  0.137706  0.764015
2  0.342464  0.644530

### DATAFRAME CREATION--->

In [8]:
import numpy as np
import pandas as pd
data = {
    "Name": ["John", "Emma", "Sam"],
    "Age": [22, 28, np.nan ],         #np.nan is a special value representing missing or 
                                       #undefined data in a DataFrame or array.
    "Sex": ["Male", "Female", "Male"],
    "Pclass": [3, 1, 3]
}

df = pd.DataFrame(data)
df

   Name   Age     Sex  Pclass
0  John  22.0    Male       3
1  Emma  28.0  Female       1
2   Sam   NaN    Male       3

### INDEXING AND SLICING--->

In [13]:

# Using .loc (label-based)           #df.loc → use labels (row labels, column names).
df.loc[0:2, ["Name", "Age"]]          #0:2 → pick rows from label 0 through label 2 (inclusive).
                                     #["Name", "Age"] → pick only these two columns.

# Using .iloc (position-based)
df.iloc[1:4, 0:3]                  #[row_position, column_position]

   Name   Age     Sex
1  Emma  28.0  Female
2   Sam   NaN    Male

### DATA CLEANING--->

In [20]:
import pandas as pd
import numpy as np

data = {
    "Name": ["John", "Emma", "Sam", "Olivia"],
    "Age": [22, np.nan, 30, np.nan],
    "Sex": ["Male", "Female", "Male", "Female"],
    "Cabin": [np.nan, "C123", np.nan, "B45"],
    "Fare": [100, 200, 150, 250]
}

df = pd.DataFrame(data)
print(df)

# Drop rows with NaN values
#df.dropna()                 # Removes any row that has at least one NaN.

# fillna() replaces missing values.
 df.fillna({"Age": df["Age"].mean(), "Cabin": "Unknown"})
      #Age--replace NaN with mean of available ages = (22 + 30) / 2 = 26.0 
      #cabin-replace NaN with "Unknown"

# Drop a column
df.drop("Cabin",axis=1)

# Rename columns
df.rename(columns={"Sex": "Gender", "Fare": "TicketFare"})

     Name   Age     Sex Cabin  Fare
0    John  22.0    Male   NaN   100
1    Emma   NaN  Female  C123   200
2     Sam  30.0    Male   NaN   150
3  Olivia   NaN  Female   B45   250

     Name   Age     Sex  Fare
0    John  22.0    Male   100
1    Emma   NaN  Female   200
2     Sam  30.0    Male   150
3  Olivia   NaN  Female   250

### AGGREGATION--->

In [ ]:
# Group by Gender and get mean Age
df.groupby("Sex")["Age"].mean()

# Sum of fares per class
df.groupby("Pclass")["Fare"].sum()

# Pivot Table
pd.pivot_table(df, values="Fare", index="Pclass", columns="Sex", aggfunc="mean")

### MERGING AND JOINING--->

In [ ]:
extra = pd.DataFrame({
    "Name": ["John", "Emma", "Sophia"],
    "City": ["NY", "London", "Paris"]
})

# Merge on 'Name'
pd.merge(df, extra, on="Name", how="left")

### EXPORTING--->

In [ ]:
# To CSV
df.to_csv("passengers.csv", index=False)

# To Excel
df.to_excel("passengers.xlsx", index=False)